# ToposolidFloorOverlap Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
BuiltInFailures..::..OverlapFailures..::..ToposolidFloorOverlap Property
BuiltInFailures..::..OverlapFailures Class See Also
---
Highlighted toposolid and floor overlap.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static FailureDefinitionId ToposolidFloorOverlap { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property ToposolidFloorOverlap As FailureDefinitionId
	Get
```

Visual C++
---
```text
public:
static property FailureDefinitionId^ ToposolidFloorOverlap {
	FailureDefinitionId^ get ();
}
```

# See Also
BuiltInFailures..::..OverlapFailures Class
Autodesk.Revit.DB Namespace